[metadata]
creation_date = "2024/05/20"
updated_date = "2024/09/01"
maturity = "development"
min_stack_version = "9.3.1"

[rule]
name = "Potential DNS Tunneling Activity"
rule_id = "c3d4e5f6-7a8b-9c0d-1e2f-3a4b5c6d7e8f"
description = """
Detects unusually long DNS queries that may indicate DNS tunneling,
a technique used to exfiltrate data or establish covert communication channels.
"""
risk_score = 21
severity = "low"
type = "query"
tags = ["Network", "Exfiltration", "T1048", "T1071.004", "Elastic", "DNS"]

query = '''
dns.question.name : *.*.*.*.*.*.*  and not dns.question.name : (*.in-addr.arpa or *.ip6.arpa)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  id = "TA0010"
  name = "Exfiltration"
  reference = "https://attack.mitre.org/tactics/TA0010/"

  [[rule.threat.technique]]
  id = "T1048"
  name = "Exfiltration Over Alternative Protocol"
  reference = "https://attack.mitre.org/techniques/T1048/"
