[metadata]
creation_date = "2024/01/15"
updated_date = "2024/09/01"
maturity = "production"
min_stack_version = "9.3.1"

[rule]
name = "Credential Dumping via LSASS Memory Access"
rule_id = "a]f1e2d3-4a5b-6c7d-8e9f-0a1b2c3d4e5f"
description = """
Detects attempts to access LSASS process memory, which is a common technique
used by attackers to dump credentials from a Windows system.
"""
risk_score = 73
severity = "high"
type = "eql"
tags = ["Windows", "Credential Access", "T1003", "T1003.001", "Elastic", "LSASS"]

query = '''
process where event.type == "start" and
  process.name : ("procdump.exe", "procdump64.exe", "mimikatz.exe") and
  process.args : ("lsass*", "-ma lsass*")
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  id = "TA0006"
  name = "Credential Access"
  reference = "https://attack.mitre.org/tactics/TA0006/"

  [[rule.threat.technique]]
  id = "T1003"
  name = "OS Credential Dumping"
  reference = "https://attack.mitre.org/techniques/T1003/"

    [[rule.threat.technique.subtechnique]]
    id = "T1003.001"
    name = "LSASS Memory"
    reference = "https://attack.mitre.org/techniques/T1003/001/"
